Revit 2027 API
ScheduleFilter Constructor
Overload List
Name | Description
ScheduleFilter() |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, ElementId) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Double) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Int32) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, String) |  Creates a new ScheduleFilter.
Top
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace